{"class_name": "Model", "keras_version": "1.0.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 224, 224], "name": "input_1", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv1/7x7_s2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 7, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 7}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "conv1/7x7_s2"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_1"}, "inbound_nodes": [[["conv1/7x7_s2", 0, 0]]], "name": "zeropadding2d_1"}, {"class_name": "Lambda", "config": {"function": "c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0006\u0000\u0000\u0000S\u0000\u0000\u0000s,\u0000\u0000\u0000|\u0000\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000f\u0004\u0000\u0019S(\u0002\u0000\u0000\u0000Ni\u0001\u0000\u0000\u0000(\u0000\u0000\u0000\u0000(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000X(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u0010\u0000\u0000\u0000custom_layers.pyt\u0001\u0000\u0000\u0000f!\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0002", "name": "lambda_1", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": "c\u0001\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0006\u0000\u0000\u0000S\u0000\u0000\u0000s6\u0000\u0000\u0000t\u0000\u0000|\u0000\u0000\u0083\u0001\u0000\\\u0004\u0000}\u0001\u0000}\u0002\u0000}\u0003\u0000}\u0004\u0000t\u0001\u0000|\u0001\u0000|\u0002\u0000|\u0003\u0000d\u0001\u0000\u0018|\u0004\u0000d\u0001\u0000\u0018g\u0004\u0000\u0083\u0001\u0000S(\u0002\u0000\u0000\u0000Ni\u0001\u0000\u0000\u0000(\u0002\u0000\u0000\u0000t\u0004\u0000\u0000\u0000listt\u0005\u0000\u0000\u0000tuple(\u0005\u0000\u0000\u0000t\u000b\u0000\u0000\u0000input_shapet\u0001\u0000\u0000\u0000bt\u0002\u0000\u0000\u0000cht\u0001\u0000\u0000\u0000ht\u0001\u0000\u0000\u0000w(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u0010\u0000\u0000\u0000custom_layers.pyt\u000e\u0000\u0000\u0000f_output_shape%\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\u0018\u0001", "output_shape_type": "lambda"}, "inbound_nodes": [[["zeropadding2d_1", 0, 0]]], "name": "lambda_1"}, {"class_name": "MaxPooling2D", "config": {"name": "pool1/3x3_s2", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["lambda_1", 0, 0]]], "name": "pool1/3x3_s2"}, {"class_name": "Lambda", "config": {"function": "c\u0001\u0000\u0000\u0000\u000b\u0000\u0000\u0000\t\u0000\u0000\u0000\u0013\u0000\u0000\u0000s\u0002\u0001\u0000\u0000|\u0000\u0000j\u0000\u0000\\\u0004\u0000}\u0001\u0000}\u0002\u0000}\u0003\u0000}\u0004\u0000\u0088\u0003\u0000d\u0001\u0000\u001a}\u0005\u0000t\u0001\u0000j\u0002\u0000|\u0000\u0000\u0083\u0001\u0000}\u0006\u0000t\u0001\u0000j\u0003\u0000d\u0002\u0000|\u0001\u0000|\u0002\u0000d\u0001\u0000|\u0005\u0000\u0014\u0017|\u0003\u0000|\u0004\u0000\u0083\u0005\u0000}\u0007\u0000t\u0001\u0000j\u0004\u0000|\u0007\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000|\u0005\u0000|\u0005\u0000|\u0002\u0000\u0017\u0085\u0002\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000f\u0004\u0000\u0019|\u0006\u0000\u0083\u0002\u0000}\u0006\u0000\u0088\u0002\u0000}\b\u0000\u0088\u0000\u0000\u0088\u0003\u0000\u0015}\t\u0000xN\u0000t\u0005\u0000\u0088\u0003\u0000\u0083\u0001\u0000D]@\u0000}\n\u0000|\b\u0000|\t\u0000|\u0006\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000|\n\u0000|\n\u0000|\u0002\u0000\u0017\u0085\u0002\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000f\u0004\u0000\u0019\u00147}\b\u0000q\u00ac\u0000W|\b\u0000\u0088\u0001\u0000\u0013}\b\u0000|\u0000\u0000|\b\u0000\u0015S(\u0003\u0000\u0000\u0000Ni\u0002\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000(\u0006\u0000\u0000\u0000t\u0005\u0000\u0000\u0000shapet\u0001\u0000\u0000\u0000Tt\u0003\u0000\u0000\u0000sqrt\u0005\u0000\u0000\u0000alloct\r\u0000\u0000\u0000set_subtensort\u0005\u0000\u0000\u0000range(\u000b\u0000\u0000\u0000t\u0001\u0000\u0000\u0000Xt\u0001\u0000\u0000\u0000bt\u0002\u0000\u0000\u0000cht\u0001\u0000\u0000\u0000rt\u0001\u0000\u0000\u0000ct\u0006\u0000\u0000\u0000half_nt\t\u0000\u0000\u0000input_sqrt\u000e\u0000\u0000\u0000extra_channelst\u0005\u0000\u0000\u0000scalet\n\u0000\u0000\u0000norm_alphat\u0001\u0000\u0000\u0000i(\u0004\u0000\u0000\u0000t\u0005\u0000\u0000\u0000alphat\u0004\u0000\u0000\u0000betat\u0001\u0000\u0000\u0000kt\u0001\u0000\u0000\u0000n(\u0000\u0000\u0000\u0000s\u0010\u0000\u0000\u0000custom_layers.pyt\u0001\u0000\u0000\u0000f0\u0000\u0000\u0000s\u0016\u0000\u0000\u0000\u0000\u0001\u0015\u0001\n\u0001\u000f\u0001#\u0001>\u0001\u0006\u0001\n\u0001\u0013\u0001>\u0001\n\u0001", "name": "pool1/norm1", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": "c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000S\u0000\u0000\u0000s\u0004\u0000\u0000\u0000|\u0000\u0000S(\u0001\u0000\u0000\u0000N(\u0000\u0000\u0000\u0000(\u0001\u0000\u0000\u0000t\u000b\u0000\u0000\u0000input_shape(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u0010\u0000\u0000\u0000custom_layers.pyt\b\u0000\u0000\u0000<lambda>=\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", "output_shape_type": "lambda"}, "inbound_nodes": [[["pool1/3x3_s2", 0, 0]]], "name": "pool1/norm1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv2/3x3_reduce", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["pool1/norm1", 0, 0]]], "name": "conv2/3x3_reduce"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv2/3x3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 192, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["conv2/3x3_reduce", 0, 0]]], "name": "conv2/3x3"}, {"class_name": "Lambda", "config": {"function": "c\u0001\u0000\u0000\u0000\u000b\u0000\u0000\u0000\t\u0000\u0000\u0000\u0013\u0000\u0000\u0000s\u0002\u0001\u0000\u0000|\u0000\u0000j\u0000\u0000\\\u0004\u0000}\u0001\u0000}\u0002\u0000}\u0003\u0000}\u0004\u0000\u0088\u0003\u0000d\u0001\u0000\u001a}\u0005\u0000t\u0001\u0000j\u0002\u0000|\u0000\u0000\u0083\u0001\u0000}\u0006\u0000t\u0001\u0000j\u0003\u0000d\u0002\u0000|\u0001\u0000|\u0002\u0000d\u0001\u0000|\u0005\u0000\u0014\u0017|\u0003\u0000|\u0004\u0000\u0083\u0005\u0000}\u0007\u0000t\u0001\u0000j\u0004\u0000|\u0007\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000|\u0005\u0000|\u0005\u0000|\u0002\u0000\u0017\u0085\u0002\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000f\u0004\u0000\u0019|\u0006\u0000\u0083\u0002\u0000}\u0006\u0000\u0088\u0002\u0000}\b\u0000\u0088\u0000\u0000\u0088\u0003\u0000\u0015}\t\u0000xN\u0000t\u0005\u0000\u0088\u0003\u0000\u0083\u0001\u0000D]@\u0000}\n\u0000|\b\u0000|\t\u0000|\u0006\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000|\n\u0000|\n\u0000|\u0002\u0000\u0017\u0085\u0002\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000f\u0004\u0000\u0019\u00147}\b\u0000q\u00ac\u0000W|\b\u0000\u0088\u0001\u0000\u0013}\b\u0000|\u0000\u0000|\b\u0000\u0015S(\u0003\u0000\u0000\u0000Ni\u0002\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000(\u0006\u0000\u0000\u0000t\u0005\u0000\u0000\u0000shapet\u0001\u0000\u0000\u0000Tt\u0003\u0000\u0000\u0000sqrt\u0005\u0000\u0000\u0000alloct\r\u0000\u0000\u0000set_subtensort\u0005\u0000\u0000\u0000range(\u000b\u0000\u0000\u0000t\u0001\u0000\u0000\u0000Xt\u0001\u0000\u0000\u0000bt\u0002\u0000\u0000\u0000cht\u0001\u0000\u0000\u0000rt\u0001\u0000\u0000\u0000ct\u0006\u0000\u0000\u0000half_nt\t\u0000\u0000\u0000input_sqrt\u000e\u0000\u0000\u0000extra_channelst\u0005\u0000\u0000\u0000scalet\n\u0000\u0000\u0000norm_alphat\u0001\u0000\u0000\u0000i(\u0004\u0000\u0000\u0000t\u0005\u0000\u0000\u0000alphat\u0004\u0000\u0000\u0000betat\u0001\u0000\u0000\u0000kt\u0001\u0000\u0000\u0000n(\u0000\u0000\u0000\u0000s\u0010\u0000\u0000\u0000custom_layers.pyt\u0001\u0000\u0000\u0000f0\u0000\u0000\u0000s\u0016\u0000\u0000\u0000\u0000\u0001\u0015\u0001\n\u0001\u000f\u0001#\u0001>\u0001\u0006\u0001\n\u0001\u0013\u0001>\u0001\n\u0001", "name": "conv2/norm2", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": "c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000S\u0000\u0000\u0000s\u0004\u0000\u0000\u0000|\u0000\u0000S(\u0001\u0000\u0000\u0000N(\u0000\u0000\u0000\u0000(\u0001\u0000\u0000\u0000t\u000b\u0000\u0000\u0000input_shape(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u0010\u0000\u0000\u0000custom_layers.pyt\b\u0000\u0000\u0000<lambda>=\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", "output_shape_type": "lambda"}, "inbound_nodes": [[["conv2/3x3", 0, 0]]], "name": "conv2/norm2"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_2"}, "inbound_nodes": [[["conv2/norm2", 0, 0]]], "name": "zeropadding2d_2"}, {"class_name": "Lambda", "config": {"function": "c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0006\u0000\u0000\u0000S\u0000\u0000\u0000s,\u0000\u0000\u0000|\u0000\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000f\u0004\u0000\u0019S(\u0002\u0000\u0000\u0000Ni\u0001\u0000\u0000\u0000(\u0000\u0000\u0000\u0000(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000X(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u0010\u0000\u0000\u0000custom_layers.pyt\u0001\u0000\u0000\u0000f!\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0002", "name": "lambda_2", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": "c\u0001\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0006\u0000\u0000\u0000S\u0000\u0000\u0000s6\u0000\u0000\u0000t\u0000\u0000|\u0000\u0000\u0083\u0001\u0000\\\u0004\u0000}\u0001\u0000}\u0002\u0000}\u0003\u0000}\u0004\u0000t\u0001\u0000|\u0001\u0000|\u0002\u0000|\u0003\u0000d\u0001\u0000\u0018|\u0004\u0000d\u0001\u0000\u0018g\u0004\u0000\u0083\u0001\u0000S(\u0002\u0000\u0000\u0000Ni\u0001\u0000\u0000\u0000(\u0002\u0000\u0000\u0000t\u0004\u0000\u0000\u0000listt\u0005\u0000\u0000\u0000tuple(\u0005\u0000\u0000\u0000t\u000b\u0000\u0000\u0000input_shapet\u0001\u0000\u0000\u0000bt\u0002\u0000\u0000\u0000cht\u0001\u0000\u0000\u0000ht\u0001\u0000\u0000\u0000w(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u0010\u0000\u0000\u0000custom_layers.pyt\u000e\u0000\u0000\u0000f_output_shape%\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\u0018\u0001", "output_shape_type": "lambda"}, "inbound_nodes": [[["zeropadding2d_2", 0, 0]]], "name": "lambda_2"}, {"class_name": "MaxPooling2D", "config": {"name": "pool2/3x3_s2", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["lambda_2", 0, 0]]], "name": "pool2/3x3_s2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3a/3x3_reduce", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 96, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["pool2/3x3_s2", 0, 0]]], "name": "inception_3a/3x3_reduce"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3a/5x5_reduce", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["pool2/3x3_s2", 0, 0]]], "name": "inception_3a/5x5_reduce"}, {"class_name": "MaxPooling2D", "config": {"name": "inception_3a/pool", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [1, 1], "border_mode": "same"}, "inbound_nodes": [[["pool2/3x3_s2", 0, 0]]], "name": "inception_3a/pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3a/1x1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["pool2/3x3_s2", 0, 0]]], "name": "inception_3a/1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3a/3x3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["inception_3a/3x3_reduce", 0, 0]]], "name": "inception_3a/3x3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3a/5x5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 5}, "inbound_nodes": [[["inception_3a/5x5_reduce", 0, 0]]], "name": "inception_3a/5x5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3a/pool_proj", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_3a/pool", 0, 0]]], "name": "inception_3a/pool_proj"}, {"class_name": "Merge", "config": {"name": "inception_3a/output", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["inception_3a/1x1", 0, 0], ["inception_3a/3x3", 0, 0], ["inception_3a/5x5", 0, 0], ["inception_3a/pool_proj", 0, 0]]], "name": "inception_3a/output"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3b/3x3_reduce", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_3a/output", 0, 0]]], "name": "inception_3b/3x3_reduce"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3b/5x5_reduce", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_3a/output", 0, 0]]], "name": "inception_3b/5x5_reduce"}, {"class_name": "MaxPooling2D", "config": {"name": "inception_3b/pool", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [1, 1], "border_mode": "same"}, "inbound_nodes": [[["inception_3a/output", 0, 0]]], "name": "inception_3b/pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3b/1x1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_3a/output", 0, 0]]], "name": "inception_3b/1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3b/3x3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 192, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["inception_3b/3x3_reduce", 0, 0]]], "name": "inception_3b/3x3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3b/5x5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 96, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 5}, "inbound_nodes": [[["inception_3b/5x5_reduce", 0, 0]]], "name": "inception_3b/5x5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3b/pool_proj", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_3b/pool", 0, 0]]], "name": "inception_3b/pool_proj"}, {"class_name": "Merge", "config": {"name": "inception_3b/output", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["inception_3b/1x1", 0, 0], ["inception_3b/3x3", 0, 0], ["inception_3b/5x5", 0, 0], ["inception_3b/pool_proj", 0, 0]]], "name": "inception_3b/output"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_3"}, "inbound_nodes": [[["inception_3b/output", 0, 0]]], "name": "zeropadding2d_3"}, {"class_name": "Lambda", "config": {"function": "c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0006\u0000\u0000\u0000S\u0000\u0000\u0000s,\u0000\u0000\u0000|\u0000\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000f\u0004\u0000\u0019S(\u0002\u0000\u0000\u0000Ni\u0001\u0000\u0000\u0000(\u0000\u0000\u0000\u0000(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000X(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u0010\u0000\u0000\u0000custom_layers.pyt\u0001\u0000\u0000\u0000f!\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0002", "name": "lambda_3", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": "c\u0001\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0006\u0000\u0000\u0000S\u0000\u0000\u0000s6\u0000\u0000\u0000t\u0000\u0000|\u0000\u0000\u0083\u0001\u0000\\\u0004\u0000}\u0001\u0000}\u0002\u0000}\u0003\u0000}\u0004\u0000t\u0001\u0000|\u0001\u0000|\u0002\u0000|\u0003\u0000d\u0001\u0000\u0018|\u0004\u0000d\u0001\u0000\u0018g\u0004\u0000\u0083\u0001\u0000S(\u0002\u0000\u0000\u0000Ni\u0001\u0000\u0000\u0000(\u0002\u0000\u0000\u0000t\u0004\u0000\u0000\u0000listt\u0005\u0000\u0000\u0000tuple(\u0005\u0000\u0000\u0000t\u000b\u0000\u0000\u0000input_shapet\u0001\u0000\u0000\u0000bt\u0002\u0000\u0000\u0000cht\u0001\u0000\u0000\u0000ht\u0001\u0000\u0000\u0000w(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u0010\u0000\u0000\u0000custom_layers.pyt\u000e\u0000\u0000\u0000f_output_shape%\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\u0018\u0001", "output_shape_type": "lambda"}, "inbound_nodes": [[["zeropadding2d_3", 0, 0]]], "name": "lambda_3"}, {"class_name": "MaxPooling2D", "config": {"name": "pool3/3x3_s2", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["lambda_3", 0, 0]]], "name": "pool3/3x3_s2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4a/3x3_reduce", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 96, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["pool3/3x3_s2", 0, 0]]], "name": "inception_4a/3x3_reduce"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4a/5x5_reduce", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["pool3/3x3_s2", 0, 0]]], "name": "inception_4a/5x5_reduce"}, {"class_name": "MaxPooling2D", "config": {"name": "inception_4a/pool", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [1, 1], "border_mode": "same"}, "inbound_nodes": [[["pool3/3x3_s2", 0, 0]]], "name": "inception_4a/pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4a/1x1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 192, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["pool3/3x3_s2", 0, 0]]], "name": "inception_4a/1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4a/3x3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 208, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["inception_4a/3x3_reduce", 0, 0]]], "name": "inception_4a/3x3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4a/5x5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 48, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 5}, "inbound_nodes": [[["inception_4a/5x5_reduce", 0, 0]]], "name": "inception_4a/5x5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4a/pool_proj", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_4a/pool", 0, 0]]], "name": "inception_4a/pool_proj"}, {"class_name": "Merge", "config": {"name": "inception_4a/output", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["inception_4a/1x1", 0, 0], ["inception_4a/3x3", 0, 0], ["inception_4a/5x5", 0, 0], ["inception_4a/pool_proj", 0, 0]]], "name": "inception_4a/output"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4b/3x3_reduce", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 112, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_4a/output", 0, 0]]], "name": "inception_4b/3x3_reduce"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4b/5x5_reduce", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 24, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_4a/output", 0, 0]]], "name": "inception_4b/5x5_reduce"}, {"class_name": "MaxPooling2D", "config": {"name": "inception_4b/pool", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [1, 1], "border_mode": "same"}, "inbound_nodes": [[["inception_4a/output", 0, 0]]], "name": "inception_4b/pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4b/1x1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 160, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_4a/output", 0, 0]]], "name": "inception_4b/1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4b/3x3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 224, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["inception_4b/3x3_reduce", 0, 0]]], "name": "inception_4b/3x3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4b/5x5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 5}, "inbound_nodes": [[["inception_4b/5x5_reduce", 0, 0]]], "name": "inception_4b/5x5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4b/pool_proj", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_4b/pool", 0, 0]]], "name": "inception_4b/pool_proj"}, {"class_name": "Merge", "config": {"name": "inception_4b_output", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["inception_4b/1x1", 0, 0], ["inception_4b/3x3", 0, 0], ["inception_4b/5x5", 0, 0], ["inception_4b/pool_proj", 0, 0]]], "name": "inception_4b_output"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4c/3x3_reduce", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_4b_output", 0, 0]]], "name": "inception_4c/3x3_reduce"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4c/5x5_reduce", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 24, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_4b_output", 0, 0]]], "name": "inception_4c/5x5_reduce"}, {"class_name": "MaxPooling2D", "config": {"name": "inception_4c/pool", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [1, 1], "border_mode": "same"}, "inbound_nodes": [[["inception_4b_output", 0, 0]]], "name": "inception_4c/pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4c/1x1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_4b_output", 0, 0]]], "name": "inception_4c/1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4c/3x3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["inception_4c/3x3_reduce", 0, 0]]], "name": "inception_4c/3x3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4c/5x5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 5}, "inbound_nodes": [[["inception_4c/5x5_reduce", 0, 0]]], "name": "inception_4c/5x5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4c/pool_proj", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_4c/pool", 0, 0]]], "name": "inception_4c/pool_proj"}, {"class_name": "Merge", "config": {"name": "inception_4c/output", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["inception_4c/1x1", 0, 0], ["inception_4c/3x3", 0, 0], ["inception_4c/5x5", 0, 0], ["inception_4c/pool_proj", 0, 0]]], "name": "inception_4c/output"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4d/3x3_reduce", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 144, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_4c/output", 0, 0]]], "name": "inception_4d/3x3_reduce"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4d/5x5_reduce", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_4c/output", 0, 0]]], "name": "inception_4d/5x5_reduce"}, {"class_name": "MaxPooling2D", "config": {"name": "inception_4d/pool", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [1, 1], "border_mode": "same"}, "inbound_nodes": [[["inception_4c/output", 0, 0]]], "name": "inception_4d/pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4d/1x1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 112, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_4c/output", 0, 0]]], "name": "inception_4d/1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4d/3x3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 288, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["inception_4d/3x3_reduce", 0, 0]]], "name": "inception_4d/3x3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4d/5x5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 5}, "inbound_nodes": [[["inception_4d/5x5_reduce", 0, 0]]], "name": "inception_4d/5x5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4d/pool_proj", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_4d/pool", 0, 0]]], "name": "inception_4d/pool_proj"}, {"class_name": "Merge", "config": {"name": "inception_4d/output", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["inception_4d/1x1", 0, 0], ["inception_4d/3x3", 0, 0], ["inception_4d/5x5", 0, 0], ["inception_4d/pool_proj", 0, 0]]], "name": "inception_4d/output"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4e/3x3_reduce", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 160, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_4d/output", 0, 0]]], "name": "inception_4e/3x3_reduce"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4e/5x5_reduce", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_4d/output", 0, 0]]], "name": "inception_4e/5x5_reduce"}, {"class_name": "MaxPooling2D", "config": {"name": "inception_4e/pool", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [1, 1], "border_mode": "same"}, "inbound_nodes": [[["inception_4d/output", 0, 0]]], "name": "inception_4e/pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4e/1x1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_4d/output", 0, 0]]], "name": "inception_4e/1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4e/3x3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 320, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["inception_4e/3x3_reduce", 0, 0]]], "name": "inception_4e/3x3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4e/5x5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 5}, "inbound_nodes": [[["inception_4e/5x5_reduce", 0, 0]]], "name": "inception_4e/5x5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4e/pool_proj", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_4e/pool", 0, 0]]], "name": "inception_4e/pool_proj"}, {"class_name": "Merge", "config": {"name": "inception_4e/output", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["inception_4e/1x1", 0, 0], ["inception_4e/3x3", 0, 0], ["inception_4e/5x5", 0, 0], ["inception_4e/pool_proj", 0, 0]]], "name": "inception_4e/output"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_4"}, "inbound_nodes": [[["inception_4e/output", 0, 0]]], "name": "zeropadding2d_4"}, {"class_name": "Lambda", "config": {"function": "c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0006\u0000\u0000\u0000S\u0000\u0000\u0000s,\u0000\u0000\u0000|\u0000\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000f\u0004\u0000\u0019S(\u0002\u0000\u0000\u0000Ni\u0001\u0000\u0000\u0000(\u0000\u0000\u0000\u0000(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000X(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u0010\u0000\u0000\u0000custom_layers.pyt\u0001\u0000\u0000\u0000f!\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0002", "name": "lambda_4", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": "c\u0001\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0006\u0000\u0000\u0000S\u0000\u0000\u0000s6\u0000\u0000\u0000t\u0000\u0000|\u0000\u0000\u0083\u0001\u0000\\\u0004\u0000}\u0001\u0000}\u0002\u0000}\u0003\u0000}\u0004\u0000t\u0001\u0000|\u0001\u0000|\u0002\u0000|\u0003\u0000d\u0001\u0000\u0018|\u0004\u0000d\u0001\u0000\u0018g\u0004\u0000\u0083\u0001\u0000S(\u0002\u0000\u0000\u0000Ni\u0001\u0000\u0000\u0000(\u0002\u0000\u0000\u0000t\u0004\u0000\u0000\u0000listt\u0005\u0000\u0000\u0000tuple(\u0005\u0000\u0000\u0000t\u000b\u0000\u0000\u0000input_shapet\u0001\u0000\u0000\u0000bt\u0002\u0000\u0000\u0000cht\u0001\u0000\u0000\u0000ht\u0001\u0000\u0000\u0000w(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u0010\u0000\u0000\u0000custom_layers.pyt\u000e\u0000\u0000\u0000f_output_shape%\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\u0018\u0001", "output_shape_type": "lambda"}, "inbound_nodes": [[["zeropadding2d_4", 0, 0]]], "name": "lambda_4"}, {"class_name": "MaxPooling2D", "config": {"name": "pool4/3x3_s2", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["lambda_4", 0, 0]]], "name": "pool4/3x3_s2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_5a/3x3_reduce", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 160, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["pool4/3x3_s2", 0, 0]]], "name": "inception_5a/3x3_reduce"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_5a/5x5_reduce", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["pool4/3x3_s2", 0, 0]]], "name": "inception_5a/5x5_reduce"}, {"class_name": "MaxPooling2D", "config": {"name": "inception_5a/pool", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [1, 1], "border_mode": "same"}, "inbound_nodes": [[["pool4/3x3_s2", 0, 0]]], "name": "inception_5a/pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_5a/1x1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["pool4/3x3_s2", 0, 0]]], "name": "inception_5a/1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_5a/3x3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 320, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["inception_5a/3x3_reduce", 0, 0]]], "name": "inception_5a/3x3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_5a/5x5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 5}, "inbound_nodes": [[["inception_5a/5x5_reduce", 0, 0]]], "name": "inception_5a/5x5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_5a/pool_proj", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_5a/pool", 0, 0]]], "name": "inception_5a/pool_proj"}, {"class_name": "Merge", "config": {"name": "inception_5a/output", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["inception_5a/1x1", 0, 0], ["inception_5a/3x3", 0, 0], ["inception_5a/5x5", 0, 0], ["inception_5a/pool_proj", 0, 0]]], "name": "inception_5a/output"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_5b/3x3_reduce", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 192, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_5a/output", 0, 0]]], "name": "inception_5b/3x3_reduce"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_5b/5x5_reduce", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 48, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_5a/output", 0, 0]]], "name": "inception_5b/5x5_reduce"}, {"class_name": "MaxPooling2D", "config": {"name": "inception_5b/pool", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [1, 1], "border_mode": "same"}, "inbound_nodes": [[["inception_5a/output", 0, 0]]], "name": "inception_5b/pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_5b/1x1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 384, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_5a/output", 0, 0]]], "name": "inception_5b/1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_5b/3x3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 384, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["inception_5b/3x3_reduce", 0, 0]]], "name": "inception_5b/3x3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_5b/5x5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 5}, "inbound_nodes": [[["inception_5b/5x5_reduce", 0, 0]]], "name": "inception_5b/5x5"}, {"class_name": 